framework-common/src/main/xml/service-schema/STS/XML/Sample Token Request SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance/" xmlns:xsd="http://www.w3.org/2001/XMLSchema/" xmlns:wsa="http://www.w3.org/2005/08/addressing/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns="http://docs.oasis-open.org/ws-sx/ws-trust/200512/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:otps-wst="http://www.rsasecurity.com/rsalabs/otps/schemas/2005/09/otps-wst#" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy/" xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512/">
    <s:Header>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue/</wsa:Action>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">https://api.dpdirect.org/authenticate/</wsa:To>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>testuser</wsse:Username>
                <wsse:Password>test</wsse:Password>
            </wsse:UsernameToken>
            <otps-wst:OTPToken>
                <otps-wst:OTP>pw</otps-wst:OTP>
            </otps-wst:OTPToken>
        </wsse:Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <RequestSecurityToken xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512/">
            <wsp:AppliesTo>
                <wsa:EndpointReference>
                    <wsa:Address>https://api.dpdirect.org/</wsa:Address>
                </wsa:EndpointReference>
            </wsp:AppliesTo>
            <trust:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType>
            <trust:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</trust:RequestType>
            <trust:TokenType>urn:oasis:names:tc:SAML:2.0:assertion</trust:TokenType>
        </RequestSecurityToken>
    </s:Body>
</s:Envelope>

